



<?php


return
[
    'error'=>'عذراً، قد حدث خطأ ما.',
    "exists-error"=> "خطأ, هناك بالفعل عنصر بنفس القيمة!",
    'errorselect' => "يجب عليك تحديد عنصر واحد على الأقل!",
    'createdgrade'=>"تم اضافة مرحلة دراسية جديدة بنجاح.",
    'deletedgrade'=>"تم حذف المرحلة الدراسية بنجاح.",
    'deletedselected'=>"تم حذف العناصر المحددة بنجاح.",
    'added-role'=>"تم, اضافة دور :role للمستخدم :name.",
    'error-role-exists'=>"المستخدم :name يملك بالفعل دور :role !",
    'classrooms-created'=>"تم أنشاء الفصول الدراسية بنجاح.",
    'error-create-classrooms'=> "عذرًا ، لم نتمكن من إنشاء الصفوف الدراسية الخاصة بك. يرجى المحاولة مرة أخرى في وقت لاحق أو الاتصال بالدعم للحصول على المساعدة.",
    'update_classroom_success' => 'تم تحديث الصفوف الدراسية بنجاح. تهانينا!',
    'delete_classroom_success' => 'تم حذف الصف الدراسي :name بنجاح.!',
    'error-classrooms-info'=>"الرجاء إدخال اسم الصف والمرحلة الدراسية للصف الدراسي",
    "gradehasclassrooms" => "لا يمكن حذف المرحلة، حيث تحتوي المرحلة الدراسية على صفوف دراسية.",
    "invalidgrade" => "المرحلة الدراسية المطلوبة غير صالحة.",
    'errorselect' => 'لم يتم تحديد اي عنصر.',
    "cantdeletedgrades" => "لا يمكن حذف المراحل الدراسية التالية لوجود صفوف دراسية مرتبطة بها",
    "nograderemoved" => "لم يتم حذف أي مراحل دراسية",
    'delete-selected'=> "حذف المحدد",







];
