


<?php


return
[
    'add-grade'=>'اضافة مرحلة دراسية',
    'grade-name-ar'=> 'اسم المرحلة الدراسية بالغة العربية',
    'grade-name-en'=> 'اسم المرحلة الدراسية بالغة الانجليزية',
    'grade-notes'=> 'معلومات عن المرحلة الدراسية',
    'add'=> 'اضافة',
    'delete-selected'=>"مسح المحدد",
    'assign-roles'=>'اضافة ادوار للمستخدمين',
    'user'=>'المستخدم',
    'role'=>'الدور',
    'select-user'=> "البحث عن مستخدم ...",
    'select-role'=> "-- اختيار دور --",
    'assign'=> "اضافة الدور للمستخدم",




];
