



<?php

return
[

    //------------------------- Update Profile information form Page ------------------------- //
    'profile-information'=>'معلومات الملف الشخصي',
    'profile-information-update'=>"قم بتحديث معلومات الملف الشخصي لحسابك وعنوان البريد الإلكتروني.",
    'photo'=>'الصورة الشخصية',
    'select-photo'=>'اختيار صورة جديدة',
    'remove-photo'=> 'حذف الصورة',
    'name'=>'الاسم',
    'email'=>'البريد الالكتروني',
    'unverified-email' => 'لم يتم التحقق من عنوان بريدك الإلكتروني.',
    're-send-verification-email' =>'انقر هنا لإعادة إرسال رسالة التحقق.',
    'new-verification-link' => 'تم إرسال رابط تحقق جديد إلى عنوان بريدك الإلكتروني.',
    'saved' => 'تم الحفظ.',
    'save' => 'حفظ',
    //--------------------------------------------------------------------------------------------//


    //------------------------ Two Factor Authentication form Page ----------------------------- //
    'two-factor-auth' => 'المصادقة الثنائية',
    'add-security' => 'أضف أمانًا إضافيًا إلى حسابك باستخدام المصادقة الثنائية.',
    'finish-enabling' => "الانتهاء من تمكين المصادقة الثنائية.",
    'enabled'=> "لقد قمت بتمكين المصادقة الثنائية.",
    'not-enabled' => "لم تقم بتمكين المصادقة الثنائية.",
    'when-enabled' => "عند تمكين المصادقة الثنائية ، ستتم مطالبتك برمز مميز آمن وعشوائي أثناء المصادقة.
    يمكنك استرداد هذا الرمز المميز من تطبيق Google Authenticator بهاتفك.",
    'finish-enabling'=>"لإنهاء تمكين المصادقة الثنائية ، امسح رمز الاستجابة السريعة التالي باستخدام تطبيق المصادقة على هاتفك
    أو أدخل مفتاح الإعداد وقدم رمز OTP الذي تم إنشاؤه.",
    'now-enabled'=>'تم تمكين المصادقة الثنائية الآن. امسح رمز الاستجابة السريعة التالي ضوئيًا باستخدام تطبيق المصادقة على هاتفك أو أدخل مفتاح الإعداد.',
    'setup-key'=>'مفتاح الإعداد',
    'code' => 'الرمز',
    'Store-recovery-codes'=>'قم بتخزين رموز الاسترداد هذه في مدير كلمات مرور آمن. يمكن استخدامها لاستعادة الوصول إلى حسابك في حالة فقد جهاز المصادقة الثنائية الخاص بك.',
    'enable-btn' => 'تفعيل',
    'regenerate-recovery-codes-btn'=>'إعادة إنشاء رموز الاسترداد',
    'confirm-btn'=>'تأكيد',
    'show-recovery-codes-btn' => 'إظهار رموز الاسترداد',
    'cancel-btn'=>'إلغاء',
    'disable-btn' => 'تعطيل',
    //--------------------------------------------------------------------------------------------//

    //------------------------------- Confirms-Password Component  ----------------------------- //
    'confirm-password'=>'يأكيد كلمة المرور',
    'confirm-msg'=> "من أجل أمانك ، يرجى تأكيد كلمة المرور الخاصة بك للمتابعة.",
    #'confirm-btn'=>'Confirm' | Available Key,
    'password'=> 'كلمة المرور',
    #'cancel-btn'=>'Cancel' | Available Key,
    //--------------------------------------------------------------------------------------------//

    //------------------------ Update Password form Page ----------------------------- //
    'update-password' => 'تعديل كلمة المرور',
    'secure-password'=>"تأكد من أن حسابك يستخدم كلمة مرور طويلة وعشوائية للبقاء آمنًا.",
    'current-password' => "كلمة المرور الحالية",
    'new-password' =>'كلمة المرور الجديدة',
    #'confirm-password'=> 'تأكيد كلمة المرور' | Available Key,
    #'saved' => 'Saved.'| Available Key,
    #'save' => 'Save'| Available Key,
    //--------------------------------------------------------------------------------------------//

    //------------------------ Logout Other Sessions form Page ----------------------------- //
    'browser-sessions'=> 'جلسات المتصفح',
    'manage-sessions-msg' => "إدارة جلساتك النشطة وتسجيل الخروج منها على متصفحات وأجهزة أخرى.",
    'sessions-content'=>'إذا لزم الأمر ، يمكنك تسجيل الخروج من جميع جلسات المتصفح الأخرى عبر جميع أجهزتك. بعض جلساتك الأخيرة مذكورة أدناه ؛ لكن،
    قد لا تكون هذه القائمة شاملة. إذا شعرت أنه تم اختراق حسابك ، فيجب عليك أيضًا تحديث كلمة المرور الخاصة بك.',
    'unknown' => 'غير معروف',
    'this-device'=> 'هذا الجهاز',
    'last-active'=>'آخر نشاط',
    'log-out-sessions-btn'=>'تسجيل الخروج من جلسات المتصفح الأخرى',
    'password-confirm-to-log-out-sessions'=>"الرجاء إدخال كلمة المرور الخاصة بك للتأكيد على رغبتك في تسجيل الخروج من جلسات المتصفح الأخرى عبر جميع أجهزتك.",
    #'password'=> 'Password',
    #'cancel-btn'=>'Cancel' | Available Key,
    //--------------------------------------------------------------------------------------------//

    //------------------------ Logout Other Sessions form Page ----------------------------- //
    'delete-account'=>'حذف الحساب',
    'delete-account-msg'=>'احذف حسابك بشكل دائم.',
    'delete-account-content'=>'بمجرد حذف حسابك ، سيتم حذف جميع موارده وبياناته نهائيًا.
    قبل حذف حسابك ، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها. ',
    'delete-account-btn'=> 'حذف الحساب',
    'delete-account-modal-content'=>'هل انت متأكد انك تريد حذف حسابك؟ بمجرد حذف حسابك ،
    سيتم حذف جميع موارده وبياناته نهائيًا. الرجاء إدخال كلمة المرور الخاصة بك لتأكيد رغبتك في حذف حسابك بشكل دائم.',
    #'password'=> 'Password' | Available Key,
    #'cancel-btn'=>'Cancel' | Available Key,
    //--------------------------------------------------------------------------------------------//

];
